[Killed] UnaryOperator
cs731/project/fuzzball.js/fuzzball.js:411:24
     }
     var isCustom = isCustomFunc(options.scorer); // check if func name is one of fuzzball's, so don't use same names..
     if (!options.cutoff || typeof options.cutoff !== "number") {
-      options.cutoff = -1;
+      options.cutoff = +1;
     }
     var pre_processor = function (choice, force_ascii) {
killedBy: Extract should return true if extract with null query not error
statusReason: Cannot read property '1' of undefined

[NoCoverage] UnaryOperator
cs731/project/fuzzball.js/fuzzball.js:837:47
     if (options.wildcards) {
       for (var i = 0; i < charArray.length; i++) {
         var char = charArray[i];
-        if (options.wildcards.indexOf(char) > -1) {
+        if (options.wildcards.indexOf(char) > +1) {
           if (charCounts[WILDCARD_KEY]) {
             charCounts[WILDCARD_KEY] += 1;
